Autodesk.Revit.DB.Analysis.ValueAtPoint.#ctor(Autodesk.Revit.DB.Analysis.ValueAtPoint)
Creates a copy of the given ValueAtPoint instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.ValueAtPoint.#ctor(System.Collections.Generic.IList{System.Double})
Creates object from an array of values
values:
Array of values, each corresponding to "measurement"
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when supplied values contain invalid (infinite or non-number) doubles
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.ValueAtPoint
Stores values at one domain point.
Each value corresponds to a "measurement" for which this value was calculated.
Since:
2011